# InsertTreeControlItem

## Description
Inserts an item into a Layout Manager tree control.

```pascal
FUNCTION InsertTreeControlItem(
				nDialogID    : LONGINT;
				nComponentID : LONGINT;
				strItemLabel : STRING;
				nParentID    : INTEGER;
				nAfterID     : INTEGER): INTEGER;
```

```python
def vs.InsertTreeControlItem(nDialogID, nComponentID, strItemLabel, nParentID, nAfterID):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT|   |
|nComponentID|LONGINT|   |
|strItemLabel|STRING|   |
|nParentID|INTEGER|   |
|nAfterID|INTEGER|   |

## Version
Availability: from VectorWorks13.0

## Category
* Dialogs - Modern